ELPasEDT/src/InformationRegisters/ШаблоныТекстаЗаписейОЖ/ШаблоныТекстаЗаписейОЖ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШаблоныТекстаЗаписейОЖ</name>
  <resources>
    <name>ШаблонТекста</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидЗаписи</name>
    <type>
      <types>CatalogRef.ВидыЗаписей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Событие</name>
    <type>
      <types>CatalogRef.События</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерШаблона</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ELPasEDT/src/InformationRegisters/ВидыЗаписейСобытияПоПодразделениям/ВидыЗаписейСобытияПоПодразделениям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВидыЗаписейСобытияПоПодразделениям</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЗаписи</name>
    <type>
      <types>CatalogRef.ВидыЗаписей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Событие</name>
    <type>
      <types>CatalogRef.События</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СобытиеПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ELPasEDT/src/Documents/ЗакреплениеВидаЗаписиИСобытийЗаПодразделением/ЗакреплениеВидаЗаписиИСобытийЗаПодразделением.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗакреплениеВидаЗаписиИСобытийЗаПодразделением</name>
  <registerRecords>InformationRegister.ВидыЗаписейСобытияПоПодразделениям</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗаписи</name>
    <type>
      <types>CatalogRef.ВидыЗаписей</types>
    </type>
  </attributes>
  <attributes>
    <name>СобытиеПоУмолчанию</name>
    <type>
      <types>CatalogRef.События</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокСобытий</name>
    <attributes>
      <name>Событие</name>
      <type>
        <types>CatalogRef.События</types>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ELPasEDT/src/Catalogs/ВидыЗаписей/ВидыЗаписей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыЗаписей</name>
  <comment>(ПОГ и ЭЖ)</comment>
  <predefined>
    <items>
      <name>Авария</name>
      <description>Авария</description>
    </items>
    <items>
      <name>Включение</name>
      <description>Включение</description>
    </items>
    <items>
      <name>ДополнениеВСоставСмены</name>
      <description>Дополнение в состав смены</description>
    </items>
    <items>
      <name>ИзменениеРежимаРаботыОборудования</name>
      <description>Изменение режима работы оборудования</description>
    </items>
    <items>
      <name>КонтрольВнешний</name>
      <description>Контроль внешний</description>
    </items>
    <items>
      <name>КонтрольЖурнала</name>
      <description>Контроль журнала</description>
    </items>
    <items>
      <name>КонтрольОборудования</name>
      <description>Контроль оборудования</description>
    </items>
    <items>
      <name>Неисправность</name>
      <description>Неисправность</description>
    </items>
    <items>
      <name>Обращение</name>
      <description>Обращение</description>
    </items>
    <items>
      <name>ОперативныеПереговоры</name>
      <description>Оперативные переговоры</description>
    </items>
    <items>
      <name>ОтклонениеПараметров</name>
      <description>Отклонение параметров</description>
    </items>
    <items>
      <name>Отключение</name>
      <description>Отключение</description>
    </items>
    <items>
      <name>ПередачаСмены</name>
      <description>Передача смены</description>
    </items>
    <items>
      <name>Прочее</name>
      <description>Прочее</description>
    </items>
    <items>
      <name>РаспоряжениеНСС</name>
      <description>Распоряжение НСС</description>
    </items>
    <items>
      <name>РемонтОборудования</name>
      <description>Ремонт оборудования</description>
    </items>
  </predefined>
  <attributes>
    <name>ЗаполнятьТЧСотрудников</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнятьТЧОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСобытиеПоУмолчанию</name>
    <type>
      <types>CatalogRef.События</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписыватьЭЦП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УдалитьСобытия</name>
    <attributes>
      <name>Событие</name>
      <type>
        <types>CatalogRef.События</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ELPasEDT/src/InformationRegisters/ШаблоныТекстаЗаписейОЖ/Forms/ФормаЗаписи/Module.bsl
&НаКлиенте
Процедура СобытиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = ПолучитьСписокСобытий();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокСобытий() 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Запись.ВидЗаписи = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СписокСобытий = Новый СписокЗначений();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВидыЗаписейСобытияПоПодразделениям.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ВТ_Документ
		|ИЗ
		|	РегистрСведений.ВидыЗаписейСобытияПоПодразделениям КАК ВидыЗаписейСобытияПоПодразделениям
		|ГДЕ
		|	ВидыЗаписейСобытияПоПодразделениям.Подразделение = &Подразделение
		|	И ВидыЗаписейСобытияПоПодразделениям.ВидЗаписи = &ВидЗаписи
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидыЗаписейСобытияПоПодразделениям.Период УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗакреплениеВидаЗаписиИСобытийЗаПодразделениемСписокСобытий.Событие КАК Событие
		|ИЗ
		|	Документ.ЗакреплениеВидаЗаписиИСобытийЗаПодразделением.СписокСобытий КАК ЗакреплениеВидаЗаписиИСобытийЗаПодразделениемСписокСобытий
		|ГДЕ
		|	ЗакреплениеВидаЗаписиИСобытийЗаПодразделениемСписокСобытий.Ссылка.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_Документ.Регистратор КАК Регистратор
		|			ИЗ
		|				ВТ_Документ КАК ВТ_Документ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗакреплениеВидаЗаписиИСобытийЗаПодразделениемСписокСобытий.Порядок";
	
	Запрос.УстановитьПараметр("ВидЗаписи", Запись.ВидЗаписи);
	Запрос.УстановитьПараметр("Подразделение", Запись.Подразделение);  	
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		
		СписокСобытий.Добавить(Результат.Событие);
		
	КонецЦикла;
	
	Возврат СписокСобытий;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запись.Подразделение = ПараметрыСеанса.ТекущийПользователь.Подразделение;
	Запись.Организация = Запись.Подразделение.Организация;
	ЗначениеКопирования = Параметры.ЗначениеКопирования;
	Если ЗначениеЗаполнено(ЗначениеКопирования) Тогда
		Запись.НомерШаблона = ВернутьНомерШаблона(ЗначениеКопирования.ВидЗаписи, ЗначениеКопирования.Организация, ЗначениеКопирования.Подразделение, ЗначениеКопирования.Событие);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВернутьНомерШаблона(ВидЗаписи, Организация, Подразделение, Событие)   	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ШаблоныТекстаЗаписейОЖ.НомерШаблона КАК НомерШаблона
		|ИЗ
		|	РегистрСведений.ШаблоныТекстаЗаписейОЖ КАК ШаблоныТекстаЗаписейОЖ
		|ГДЕ
		|	ШаблоныТекстаЗаписейОЖ.ВидЗаписи = &ВидЗаписи
		|	И ШаблоныТекстаЗаписейОЖ.Событие = &Событие
		|	И ШаблоныТекстаЗаписейОЖ.Подразделение = &Подразделение
		|	И ШаблоныТекстаЗаписейОЖ.Организация = &Организация
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерШаблона УБЫВ";
	
	Запрос.УстановитьПараметр("ВидЗаписи", ВидЗаписи);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Событие", Событие);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.НомерШаблона + 1;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СобытиеПриИзменении(Элемент)
	
	Если Не СобытиеРазрешено() Тогда
		Запись.Событие = Неопределено;
		Элемент = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СобытиеРазрешено()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	1 КАК Поле1
		|ИЗ
		|	РегистрСведений.ВидыЗаписейСобытияПоПодразделениям.СрезПоследних(
		|			,
		|			Подразделение = &Подразделение
		|				И ВидЗаписи = &ВидЗаписи
		|				И Событие = &Событие) КАК ВидыЗаписейСобытияПоПодразделениямСрезПоследних";
	
	Запрос.УстановитьПараметр("ВидЗаписи", Запись.ВидЗаписи);
	Запрос.УстановитьПараметр("Событие", Запись.Событие);
	Запрос.УстановитьПараметр("Подразделение", Запись.Подразделение);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Возврат Результат.Следующий();
	
КонецФункции

&НаКлиенте
Процедура ВидЗаписиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Настройки = ПолучитьНастройкиОткрытияФормыВыбораВидаЗаписи(); 
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ФиксированныеНастройки", Настройки);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормы.Вставить("Заголовок", "Виды записей");
	ПараметрыФормы.Вставить("Подразделение", Запись.Подразделение);
	
	ОткрытьФорму("Справочник.ВидыЗаписей.Форма.ФормаВыбораВидыЗаписи", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьНастройкиОткрытияФормыВыбораВидаЗаписи() Экспорт
	
	Настройки = Новый НастройкиКомпоновкиДанных;
	
	Список = Новый СписокЗначений;
	Список.Добавить(ПредопределенноеЗначение("Справочник.ВидыЗаписей.ПередачаСмены"));
	Список.Добавить(ПредопределенноеЗначение("Справочник.ВидыЗаписей.РаспоряжениеНСС"));
    ЭлементНастройки = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементНастройки.Использование = Истина;
    ЭлементНастройки.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
    ЭлементНастройки.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
    ЭлементНастройки.ПравоеЗначение = Список;
    ЭлементНастройки.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
	
	Возврат Настройки;
	
КонецФункции

&НаКлиенте
Процедура ВидЗаписиИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ВидЗаписиПриИзменении(Элемент)
	
	Если Запись.ВидЗаписи = ПредопределенноеЗначение("Справочник.ВидыЗаписей.ПередачаСмены") Тогда
		Запись.ВидЗаписи = Неопределено;
	КонецЕсли; 
	
	Если Не ВидЗаписиРазрешен() Тогда
		Запись.ВидЗаписи = Неопределено;
		Элемент = Неопределено;
	КонецЕсли;
	
	Запись.Событие = Неопределено;	
	
КонецПроцедуры

&НаСервере
Функция ВидЗаписиРазрешен()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	1 КАК Поле1
		|ИЗ
		|	РегистрСведений.ВидыЗаписейСобытияПоПодразделениям.СрезПоследних(
		|			,
		|			Подразделение = &Подразделение
		|				И ВидЗаписи = &ВидЗаписи) КАК ВидыЗаписейСобытияПоПодразделениямСрезПоследних";
	
	Запрос.УстановитьПараметр("ВидЗаписи", Запись.ВидЗаписи);
	Запрос.УстановитьПараметр("Подразделение", Запись.Подразделение);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Возврат Результат.Следующий();
	
КонецФункции
